---
kind: other
id: Properties.T:Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
source: html/95efadcf-8e8a-0fdf-b2f0-29f4c6ce5ce2.htm
---
# RevitAPIPreDocEventArgs Properties

Indicates whether an event may be cancelled by an event delegate.